<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1190]:
# !pip install psycopg2
# !pip install python-dotenv
# !pip install sqlalchemy

In [1191]:
import os

import pandas as pd
import psycopg2
from dotenv import find_dotenv, load_dotenv
from sqlalchemy import create_engine

In [1192]:
load_dotenv(find_dotenv())

True

In [1193]:
dbname = os.getenv('DBNAME')
user = os.getenv('USER')
host = os.getenv('HOST')
password = os.getenv('PASSWORD')
port = os.getenv('PORT')

In [1194]:
# эта ячейка тупо для дебага
# print(f"""
#    DBNAME = {dbname},
#    USER = {user},
#    HOST = {host},
#    PASSWORD = {password},
#    PORT = {port}
# """)

In [1195]:
connection = create_engine(f'postgresql+psycopg2://{user}:{password}@{host}:{port}/{dbname}')

In [1196]:
connection

Engine(postgresql+psycopg2://skillfactory:***@84.201.134.129:5432/project_sql)

In [1197]:
# это если пользуем psycopg2, а не sqlalchemy (чего настоятельно не рекомендуется)
# connection = psycopg2.connect(
#     dbname=os.getenv('DBNAME'),
#     user=os.getenv('USER'),
#     host=os.getenv('HOST'),
#     password=os.getenv('PASSWORD'),
#     port=os.getenv('PORT')
# )

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [1198]:
# текст запроса
query_3_1 = f'''
    select count(v.id)
    from vacancies v
'''

In [1199]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [1200]:
# текст запроса
query_3_2 = f'''
    select count(e.id)
    from employers e
'''

In [1201]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [1202]:
# текст запроса
query_3_3 = f'''
    select count(a.id)
    from areas a
'''

In [1203]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [1204]:
# текст запроса
query_3_4 = f'''
    select count(i.id)
    from industries i
'''

In [1205]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

   count
0    294

***

Работодателей примерно вдвое меньше, чем вакансий (но это ни о чем не говорит, пока не увидим, что будет дальше). Довольно много сфер деятельности, можно сделать вывод, что работу можно найти на любой вкус и что конкуренция высока, хотя для этого тоже пока мало данных.

Я бы пока вообще воздержался на данном этапе от каких бы то ни было выводов: у нас есть несколько голых чисел, а зависимостей и их распределения мы еще вообще не знаем. Я бы посмотрел еще пару вещей, чтоб было показательно (в сравнении).

In [1206]:
# на какой график работодатели хотят затащить доверчивых соискателей?
query_3_misc_1 = f'''
    select v.employment, count(v.employment)
        from vacancies v 
        group by v.employment 
'''
df = pd.read_sql_query(query_3_misc_1, connection)
df

            employment  count
0           Стажировка    761
1  Частичная занятость   2072
2     Проектная работа    295
3     Полная занятость  46069

Видим, что больше всего хотят, чтобы "на дядю" (причем только на него любимого и единственного) батрачили полный день: аж 93,5%. Показательно. А доля других довольно мала. С одной стороны, понять их можно -- если вкладываться в работника, то и юзать его надо по полной (кто девушку ужинает, тот ее и танцует, как говорится).

Но есть и более дальновидные работодатели -- есть и вакансии со стажировкой.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [1207]:
# текст запроса
query_4_1 = f'''
    select a.name, count(v.area_id) qty
    from areas a
    join vacancies as v on v.area_id = a.id
    group by a.name
    order by qty desc, a.name
'''

In [1208]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

                name   qty
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764           Шушары     1
765      Электроугли     1
766           Эртиль     1
767             Юрга     1
768               Яя     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [1209]:
# текст запроса
query_4_2 = f'''
    select count(*)
    from vacancies v
    where v.salary_from is not null or v.salary_to is not null
'''

In [1210]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [1211]:
# текст запроса
query_4_3 = f'''
    select avg(v.salary_from)::int, avg(v.salary_to)::int
    from vacancies v
'''

In [1212]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

     avg     avg
0  71065  110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [1213]:
# текст запроса
query_4_4 = f'''
    select v.schedule, v.employment, count(v.schedule)
    from vacancies v
    group by v.schedule, v.employment
    order by 3 desc
'''

In [1214]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df.head()

           schedule           employment  count
0       Полный день     Полная занятость  35367
1  Удаленная работа     Полная занятость   7802
2     Гибкий график     Полная занятость   1593
3  Удаленная работа  Частичная занятость   1312
4    Сменный график     Полная занятость    940

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [1215]:
# текст запроса
query_4_5 = f'''
    select v.experience, count(v.experience)
    from vacancies v
    group by v.experience
    order by 2
'''

In [1216]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

Только у половины вакансий указана з/п, не знаю, хорошо это или плохо, но, скорее, плохо, ибо ухудшает поиск и выборки. По уровню з/п, на конец 2022 года -- вполне реальные значения, пока трудно судить, что тут с выбросами. 

Судя по всему, работодатели хотят порабощать человеков на полный день, чтоб они никому больше не достались. Но уже неплохо относятся к удаленной работе (видимо, теперь появляется всё больше возможностей контролировать человеков даже на удаленке, хорошо что я камеру на ноутбуке пластырем заклеил :) - как в воду глядел).

Также всё больше соглашаются на порабощение неопытных человеков: наличие опыта 1-3 года более чем в половине вакансий.

На самом деле как таковых корреляций лично я не вижу, даже при такой базе в полсотни тысяч вакансий. С одной стороны, хотят на полный день, но готовы скорее брать с небольшим опытом (видимо, они з/п меньше просят или недавно уволились и будут готовы на всё, чтобы взяли).

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [1217]:
# текст запроса
query_5_1 = f'''
    select e.name, count(v.employer_id)
    from employers e
    left join vacancies as v on v.employer_id = e.id
    group by e.name, v.employer_id
    order by 2 desc
    limit 5
'''

In [1218]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [1219]:
# текст запроса
query_5_2 = f'''
    select a.name, count(e.id) rabotodateley, count(v.id) vakansiy
    from areas a
    left join employers as e on e.area = a.id
    left join vacancies as v on v.area_id = a.id
    where v.id is null
    group by a.name
    order by 2 desc
    limit 1
'''

In [1220]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

     name  rabotodateley  vakansiy
0  Россия            410         0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [1221]:
# текст запроса
query_5_3 = f'''
    select e.name, count(distinct v.area_id)
    from employers e
    left join vacancies as v on v.employer_id = e.id
    where v.area_id is not null
    group by e.name
    order by 2 desc
'''

In [1222]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df.head(10)

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
5                  Совкомбанк     63
6                         МТС     55
7  ЭФКО, Управляющая компания     49
8                Почта России     48
9                        КРОН     48

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [1223]:
# текст запроса
query_5_4 = f'''
    select count(distinct e.id)
    from employers e
    left join employers_industries as ei on e.id = ei.employer_id
    left join industries as i on i.id = ei.industry_id
    where i.name is null
'''

In [1224]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [1225]:
# текст запроса
query_5_5 = f'''
    select e.name
    from employers e
    left join employers_industries as ei on e.id = ei.employer_id
    left join industries as i on i.id = ei.industry_id
    group by e.name
    having count(i.name) = 4
    order by e.name
    offset 2
    limit 1
'''

In [1226]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [1227]:
# текст запроса
query_5_6 = f'''
    select count(e.id)
    from employers e
    left join employers_industries as ei on e.id = ei.employer_id
    left join industries as i on i.id = ei.industry_id
    where i.name = 'Разработка программного обеспечения'
    group by e.id
'''

In [1228]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df.shape[0]

3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [1229]:
# код для получения списка городов-милионников
cities = pd.read_html('https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8')
df = cities[1]
cities_list = df['Город'].to_list()

# названия из википедии вылезают криво: вместо "Воронеж" берется "Воронеж[a]", 
# поэтому приходится перебрать полученный список и повыкидывать все вхождения [a] во всех элементах.
for city in cities_list:
    if '[a]' in city:
        new_city = cities_list.pop(cities_list.index(city)).replace('[a]', '')
        cities_list.append(new_city)
million_cities = tuple(cities_list)

In [1230]:
# текст запроса
query_5_7 = f'''
        select a.name cities, count(v.id) num_vacancies
        from vacancies v 
        left join areas as a on a.id = v.area_id 
        left join employers as e on v.employer_id = e.id 
        where e.name = 'Яндекс' and a.name in {million_cities} 
        group by cities

        union all

        select 'Total', count(v.id) 
        from vacancies v 
        left join areas as a on a.id = v.area_id 
        left join employers as e on v.employer_id = e.id 
        where e.name = 'Яндекс' and a.name in {million_cities}
        order by num_vacancies
'''

In [1231]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

             cities  num_vacancies
0              Омск             21
1         Челябинск             22
2        Красноярск             23
3         Волгоград             24
4             Пермь             25
5            Казань             25
6    Ростов-на-Дону             25
7               Уфа             26
8            Самара             26
9         Краснодар             30
10          Воронеж             32
11      Новосибирск             35
12  Нижний Новгород             36
13     Екатеринбург             39
14  Санкт-Петербург             42
15           Москва             54
16            Total            485

***

Если честно, из таких рандомных задачек нельзя сделать каких-то чётких и полезных выводов (мы не искали закономерностей, распределений и т.д.) Ну, разве что некий Поляков Денис Иванович из третьей задачи просто жжот: попасть в топ 5 это круто, при том что до этого нигде не светился...

Я бы сделал еще пару выборок, чтобы что-то существенное выявить.

In [1232]:
# узнать максимальную минимальную зп и минимальную максимальную зп, предлагаемую по вакансиям в разных регионах 
# и отсортировать, чтоб посмотреть, какие диапазоны зарплат по регионам
query_5_misc_1 = f'''
    select a.name, max(v.salary_from) max_salary_from, min(v.salary_to) min_salary_to
    from areas a
    left join vacancies v on a.id = v.area_id
    group by a.name, v.salary_from, v.salary_to
    having v.salary_from is not null and v.salary_to is not null
    order by min_salary_to desc
'''

# результат запроса
df = pd.read_sql_query(query_5_misc_1, connection)
df

                           name  max_salary_from  min_salary_to
0                        Алматы           400000        1000000
1                          Сочи           500000        1000000
2                        Москва           500000        1000000
3                        Москва           350000         950000
4               Санкт-Петербург           175346         935176
...                         ...              ...            ...
6978  Киров (Кировская область)             1000           2000
6979                   Кемерово             1500           1500
6980                  Хабаровск              750            850
6981                     Москва              250            350
6982                   Смоленск               60             60

[6983 rows x 3 columns]

Выше всего ожидания по зп в Сочи, Москве и СПб - как я и предполагал. Ну, и в Алматы.

In [1233]:
# узнать, по скольким вакансиям (по регионам) не указано нижнего и верхнего предела по зп. Отсортировать по этому кол-ву.
query_5_misc_2 = f'''
    select a.name, count(a.name)
    from areas a
    left join vacancies as v on a.id = v.area_id
    where v.salary_from is null and v.salary_to is null
    group by a.name
    order by 2 desc
'''

# результат запроса
df = pd.read_sql_query(query_5_misc_2, connection)
df

                 name  count
0              Москва   3741
1     Санкт-Петербург   1648
2               Минск   1606
3              Алматы   1249
4         Новосибирск   1077
...               ...    ...
1143         Голицыно      1
1144     Металлострой      1
1145          Ерзовка      1
1146         Оболенск      1
1147         Коченево      1

[1148 rows x 2 columns]

Тут тоже вполне ожидаемо, в Москве, СПб и других *больших* городах/регионах в вакансиях не указывают границы по зп. Думаю, это связано с ожиданием большого кол-ва откликов, из которых возможно выбирать и отсеивать.

P.S.  Я просто решил добавить две доп. выборки, чтобы было что написать в выводах. Просто иначе мне реально нечего сказать...

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [1236]:
# текст запроса
query_6_1 = f'''
    select count(*)
    from vacancies
    where name ilike '%%data%%' or name ilike '%%данн%%'
'''

In [1237]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [1238]:
# получаем вакансии для data science
filter_ds = '''
where 
    (name ilike '%%data scientist%%' or
    name ilike '%%data science%%' or
    name ilike '%%исследователь данных%%' or
    name like '%%ML%%' and name not ilike '%%html%%' or
    name ilike '%%machine%%learning%%' or
    name ilike '%%машинн%%обучен%%')
'''

In [1239]:
# текст запроса
query_6_2 = f'''
    with datascn_vacancies as
    (
        select * 
        from vacancies
        {filter_ds}
    )

    select count(*)
    from datascn_vacancies
    where
        lower(name) like '%%junior%%' or
        lower(experience) = 'нет опыта' or
        lower(employment) = 'стажировка'
'''

In [1117]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [1118]:
# текст запроса
query_6_3 = f'''
    with datascn_vacancies as
    (
        select * 
        from vacancies
        {filter_ds}
    )

    select count(*)
    from datascn_vacancies
    where lower(key_skills) like '%%postgres%%' or lower(key_skills) like '%%sql%%'
'''

In [1119]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [1120]:
# текст запроса
query_6_4 = f'''
    with datascn_vacancies as
    (
        select * 
        from vacancies
        {filter_ds}
    )

    select count(*)
    from datascn_vacancies
    where lower(key_skills) like '%%python%%'
'''

In [1121]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [1122]:
# текст запроса
query_6_5 = f'''
    select round(
        avg(length(key_skills) - length(replace(key_skills, chr(9), '')) + 1), 2) average 
        --добавляем 1, т.к. кол-во табов на 1 < кол-ва вакансий
        
    from vacancies
    
    {filter_ds}
    and key_skills is not null
'''

In [1123]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

   average
0     6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [1130]:
# текст запроса
query_6_6 = f'''
    select
        experience,
        round(avg(coalesce((salary_to + salary_from) / 2, salary_to, salary_from)))::int average
    from vacancies
    
        {filter_ds}
        and (salary_from is not null or salary_to is not null)
        and (experience is not null)
    group by experience having experience = 'От 3 до 6 лет'
'''

In [1131]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

      experience  average
0  От 3 до 6 лет   243115

***

Во-первых, в выборку для задач по этому разделу попали вакансии, где в названии было QML и AML. Т.е. выборка не суперточная, но погрешность небольшая. Во-вторых, как это ни прискорбно, вакансий для джунов всего около 50, и это вообще ни о чем. 

В задаче №3 просили поискать sql ИЛИ postgres, однако я в базе не нашел ни одного вхождения postgres отдельно от sql (везде или почти везде было postgresql), т.е. искать это через ИЛИ тоже особо смысла нет. 

6-7 навыков в среднем хотят от приходящих по вакансии дата саенс -- это немало. Т.е. хотят заполучить эдакого универсального солдата. Я не знаю, насколько это правильно, мне кажется, это губит отрасль, потому что люди не приходят из-за того, что не годятся, и идут в другие сферы. А "ожидающие" манагеры так и остаются в режиме ожидания...

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

В принцие, хотел бы подытожить словами, что база сама по себе организована весьма грамотно и ей однозначно пользоваться легко и приятно. Я уже привел выше пару-тройку дополнительных запросов, которые мне помогли лучше увидеть общую картину. Я не знаю, какой вопрос может прийти в голову просто "с потолка", мне всё же нравится работать, видя какую-то конечную цель в проекте (что-то выяснить или посчитать и т.д.), а не просто ковыряться в базе, поэтому если будут конкретные задачи -- будем их решать. Одно я понял чётко: из этой базы можно выудить еще много интересного. Ключевое слово "можно".